**Run this Jupyter Notebook**
- Run this Notebook via [**Google Colab Platform**](https://colab.research.google.com/github/mhmaem/data_science_university/blob/master/03_pandas_interactive_cheatsheets/03_01_pandas_basics.ipynb)
- Download this [**Notebook**](https://github.com/mhmaem/data_science_university/blob/master/03_pandas_interactive_cheatsheets/03_01_pandas_basics.ipynb) to run it locally

---
---
# **Pandas**
The Pandas library is built on NumPy and provides easy-to-use data structures and data analysis tools for the Python programming language.

## **Importing**

In [1]:
import pandas as pd

---
## **Data Types**
### **Series**
A one-dimensional labeled array capable of holding any data type

In [2]:
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])
s

a    3
b   -5
c    7
d    4
dtype: int64

### **DataFrame**
A two-dimensional labeled data structure with columns of potentially different types

In [3]:
data = {'Country': ['Belgium', 'India', 'Brazil'], 'Capital': ['Brussels', 'New Delhi', 'Brasília'], 'Population': [11190846, 1303171035, 207847528]}
data

{'Country': ['Belgium', 'India', 'Brazil'],
 'Capital': ['Brussels', 'New Delhi', 'Brasília'],
 'Population': [11190846, 1303171035, 207847528]}

In [4]:
df = pd.DataFrame(data, columns=['Country', 'Capital', 'Population'])
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [5]:
df2 = pd.DataFrame({'Date': ['2020-03-01', '2020-03-02', '2020-03-01', '2020-03-03', '2020-03-02', '2020-03-03'],
       'Type': ['a', 'b', 'c', 'a', 'a', 'c'],
       'Value': [11.432, 13.031, 20.784, 99.906, 1.303, 20.784]})
df2

         Date Type   Value
0  2020-03-01    a  11.432
1  2020-03-02    b  13.031
2  2020-03-01    c  20.784
3  2020-03-03    a  99.906
4  2020-03-02    a   1.303
5  2020-03-03    c  20.784

---
## **Subsitting**
### **Elements Accessing**

In [6]:
s['b']

-5

### **Slicing**

In [7]:
df[1:]

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasília   207847528

### **Access By Position**

In [8]:
df.iloc[[0],[0]]

   Country
0  Belgium

In [9]:
df.iat[0, 0]

'Belgium'

In [10]:
df2.loc[:,(df2>20).any()]

         Date Type   Value
0  2020-03-01    a  11.432
1  2020-03-02    b  13.031
2  2020-03-01    c  20.784
3  2020-03-03    a  99.906
4  2020-03-02    a   1.303
5  2020-03-03    c  20.784

In [11]:
df2.loc[:,(df2>20).all()]

         Date Type
0  2020-03-01    a
1  2020-03-02    b
2  2020-03-01    c
3  2020-03-03    a
4  2020-03-02    a
5  2020-03-03    c

In [12]:
df2.loc[(df2.Value) > 20, :]

         Date Type   Value
2  2020-03-01    c  20.784
3  2020-03-03    a  99.906
5  2020-03-03    c  20.784

In [13]:
df3 = df2.pivot(index='Date', columns='Type', values='Value')
df3.loc[:,df3.isnull().any()]

Type             b       c
Date
2020-03-01     NaN  20.784
2020-03-02  13.031     NaN
2020-03-03     NaN  20.784

In [14]:
df3.loc[:,df3.notnull().all()]

Type             a
Date
2020-03-01  11.432
2020-03-02   1.303
2020-03-03  99.906

### **By Label**

In [15]:
df.loc[[0], ['Country']]

   Country
0  Belgium

In [16]:
df.at[0, 'Country']

'Belgium'

### **With isin**

In [17]:
df_for_isin = pd.DataFrame({'num_legs': [2, 4], 'num_wings': [2, 0]}, index=['falcon', 'dog'])
df_for_isin.isin([0, 2])

        num_legs  num_wings
falcon      True       True
dog        False       True

### **With Filter**

In [18]:
df_for_filter = pd.DataFrame([[1,2,3], [4,5,6]], index=['mouse', 'rabbit'], columns=['one', 'two', 'three'])
df_for_filter.filter(items=['one', 'three'])

        one  three
mouse     1      3
rabbit    4      6

### **With Where**

In [19]:
s.where(s > 0)

a    3.0
b    NaN
c    7.0
d    4.0
dtype: float64

### **With Query**

In [20]:
import numpy as np
df_for_query = pd.DataFrame(np.random.randn(10, 2), columns=list('ab'))
df_for_query.query('a > b')

          a         b
0  0.546677  0.147387
2 -0.035718 -1.430252
6  1.355565  0.792486
7  0.231187 -0.903510
8  0.485057 -0.451625

### **Boolean Indexing**

In [21]:
s[~(s > 1)]

b   -5
dtype: int64

In [22]:
[(s < -1) | (s > 2)]

[a    True
 b    True
 c    True
 d    True
 dtype: bool]

In [23]:
df[df['Population']>1200000000]

  Country    Capital  Population
1   India  New Delhi  1303171035

In [24]:
s

a    3
b   -5
c    7
d    4
dtype: int64

---
## **Adding/Removing Elements**

In [25]:
s['y'] = -10
s['z'] = 10
s

a     3
b    -5
c     7
d     4
y   -10
z    10
dtype: int64

In [26]:
_s = s.drop(['y', 'z'])
print(_s)
print(s)

a    3
b   -5
c    7
d    4
dtype: int64
a     3
b    -5
c     7
d     4
y   -10
z    10
dtype: int64

In [27]:
s.pop('y')
s.pop('z')
s

a    3
b   -5
c    7
d    4
dtype: int64

In [28]:
_df = df.drop('Country', axis=1)
print(_df)
print(df)

     Capital  Population
0   Brussels    11190846
1  New Delhi  1303171035
2   Brasília   207847528
   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

---
## **Sorting & Ranking**

In [29]:
df.sort_index()

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [30]:
df.sort_values(by='Country')

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasília   207847528
1    India  New Delhi  1303171035

In [31]:
df.rank()

   Country  Capital  Population
0      1.0      2.0         1.0
1      3.0      3.0         3.0
2      2.0      1.0         2.0

---
## **Details**

In [32]:
df.shape

(3, 3)

In [33]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [34]:
df.columns

Index(['Country', 'Capital', 'Population'], dtype='object')

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
Country       3 non-null object
Capital       3 non-null object
Population    3 non-null int64
dtypes: int64(1), object(2)
memory usage: 152.0+ bytes

In [36]:
df.count()

Country       3
Capital       3
Population    3
dtype: int64

In [37]:
df.describe()

         Population
count  3.000000e+00
mean   5.074031e+08
std    6.961346e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555093e+08
max    1.303171e+09

---
## **Operations**
### **Arithmetic**

In [38]:
s3 = pd.Series([7, -2, 3], index=['a', 'c', 'd'])
s3

a    7
c   -2
d    3
dtype: int64

In [39]:
s + s3

a    10.0
b     NaN
c     5.0
d     7.0
dtype: float64

In [40]:
s.add(s3, fill_value=0)

a    10.0
b    -5.0
c     5.0
d     7.0
dtype: float64

In [41]:
s.sub(s3, fill_value=2)

a   -4.0
b   -7.0
c    9.0
d    1.0
dtype: float64

In [42]:
s.div(s3, fill_value=4)

a    0.428571
b   -1.250000
c   -3.500000
d    1.333333
dtype: float64

In [43]:
s.mul(s3, fill_value=3)

a    21.0
b   -15.0
c   -14.0
d    12.0
dtype: float64

### **Aggregations**

In [44]:
df.sum()

Country              BelgiumIndiaBrazil
Capital       BrusselsNew DelhiBrasília
Population                   1522209409
dtype: object

In [45]:
df.cumsum()

              Country                    Capital  Population
0             Belgium                   Brussels    11190846
1        BelgiumIndia          BrusselsNew Delhi  1314361881
2  BelgiumIndiaBrazil  BrusselsNew DelhiBrasília  1522209409

In [46]:
df.min()

Country        Belgium
Capital       Brasília
Population    11190846
dtype: object

In [47]:
df.max()

Country            India
Capital        New Delhi
Population    1303171035
dtype: object

In [48]:
df.mean()

Population    5.074031e+08
dtype: float64

In [49]:
df.median()

Population    207847528.0
dtype: float64

### **Applying Functions**

In [50]:
f = lambda x: x*2
df.apply(f, axis = 1)

          Country             Capital  Population
0  BelgiumBelgium    BrusselsBrussels    22381692
1      IndiaIndia  New DelhiNew Delhi  2606342070
2    BrazilBrazil    BrasíliaBrasília   415695056

In [51]:
df.applymap(f)

          Country             Capital  Population
0  BelgiumBelgium    BrusselsBrussels    22381692
1      IndiaIndia  New DelhiNew Delhi  2606342070
2    BrazilBrazil    BrasíliaBrasília   415695056

---
## **Reshaping**

### **Pivoting**

In [52]:
df3 = df2.pivot(index='Date', columns='Type', values='Value')
df3

Type             a       b       c
Date
2020-03-01  11.432     NaN  20.784
2020-03-02   1.303  13.031     NaN
2020-03-03  99.906     NaN  20.784

In [53]:
df4 = pd.pivot_table(df2, values='Value', index='Date', columns='Type')
df4

Type             a       b       c
Date
2020-03-01  11.432     NaN  20.784
2020-03-02   1.303  13.031     NaN
2020-03-03  99.906     NaN  20.784

### **Stacking**

In [54]:
multicol1 = pd.MultiIndex.from_tuples([('weight', 'kg'), ('weight', 'pounds')])
multicol1

MultiIndex(levels=[['weight'], ['kg', 'pounds']],
           labels=[[0, 0], [0, 1]])

In [55]:
df_multi_level_cols1 = pd.DataFrame([[1, 2], [2, 4]], index=['cat', 'dog'], columns=multicol1)
df_multi_level_cols1

    weight
        kg pounds
cat      1      2
dog      2      4

In [56]:
df_multi_level_cols1.stack()

            weight
cat kg           1
    pounds       2
dog kg           2
    pounds       4

In [57]:
df_multi_level_cols1.stack().unstack()

    weight
        kg pounds
cat      1      2
dog      2      4

### **Melt**

In [58]:
pd.melt(df2, id_vars=["Date"], value_vars=["Type", "Value"], value_name="Observations")

          Date variable Observations
0   2020-03-01     Type            a
1   2020-03-02     Type            b
2   2020-03-01     Type            c
3   2020-03-03     Type            a
4   2020-03-02     Type            a
5   2020-03-03     Type            c
6   2020-03-01    Value       11.432
7   2020-03-02    Value       13.031
8   2020-03-01    Value       20.784
9   2020-03-03    Value       99.906
10  2020-03-02    Value        1.303
11  2020-03-03    Value       20.784

## **Index Manipulation**
### **Setting/Resetting Index**

In [59]:
df.set_index('Country')

           Capital  Population
Country
Belgium   Brussels    11190846
India    New Delhi  1303171035
Brazil    Brasília   207847528

In [60]:
df4 = df.reset_index()
df4

   index  Country    Capital  Population
0      0  Belgium   Brussels    11190846
1      1    India  New Delhi  1303171035
2      2   Brazil   Brasília   207847528

In [61]:
df = df.rename(index=str, columns={"Country":"cntry", "Capital":"cptl", "Population":"ppltn"})
df

     cntry       cptl       ppltn
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

### **Reindexing**

In [62]:
s2 = s.reindex(['a','c','d','e','b'])
s2

a    3.0
c    7.0
d    4.0
e    NaN
b   -5.0
dtype: float64

### **MultiIndexing**

In [63]:
arrays = [np.array([1,2,3]), np.array([5,4,3])]
arrays

[array([1, 2, 3]), array([5, 4, 3])]

In [64]:
df5 = pd.DataFrame(np.random.rand(3, 2), index=arrays)
df5

            0         1
1 5  0.521879  0.290872
2 4  0.370143  0.570252
3 3  0.138789  0.908898

In [65]:
tuples = list(zip(*arrays))
tuples

[(1, 5), (2, 4), (3, 3)]

In [66]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex(levels=[[1, 2, 3], [3, 4, 5]],
           labels=[[0, 1, 2], [2, 1, 0]],
           names=['first', 'second'])

In [67]:
df6 = pd.DataFrame(np.random.rand(3, 2), index=index)
df6

                     0         1
first second
1     5       0.596495  0.406398
2     4       0.417064  0.754415
3     3       0.114368  0.669143

In [68]:
df2.set_index(["Date", "Type"])

                  Value
Date       Type
2020-03-01 a     11.432
2020-03-02 b     13.031
2020-03-01 c     20.784
2020-03-03 a     99.906
2020-03-02 a      1.303
2020-03-03 c     20.784

---
## **Data Manipulation**
### **Duplicate Data**

In [69]:
df2.duplicated('Type')

0    False
1    False
2    False
3     True
4     True
5     True
dtype: bool

In [70]:
df2.drop_duplicates('Type', keep='last')

         Date Type   Value
1  2020-03-02    b  13.031
4  2020-03-02    a   1.303
5  2020-03-03    c  20.784

In [71]:
df.index.duplicated()

array([False, False, False])

### **Grouping Data**

In [72]:
df2.groupby(by=['Date','Type']).mean()

                  Value
Date       Type
2020-03-01 a     11.432
           c     20.784
2020-03-02 a      1.303
           b     13.031
2020-03-03 a     99.906
           c     20.784

In [73]:
df4.groupby(level=0).sum()

   index  Population
0      0    11190846
1      1  1303171035
2      2   207847528

In [74]:
customSum = lambda x: (x+x%2)
df4.groupby(level=0).transform(customSum)

   index  Population
0      0    11190846
1      2  1303171036
2      2   207847528

### **Missing Data**

In [75]:
df.dropna()

     cntry       cptl       ppltn
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [76]:
df3.fillna(df3.mean())

Type             a       b       c
Date
2020-03-01  11.432  13.031  20.784
2020-03-02   1.303  13.031  20.784
2020-03-03  99.906  13.031  20.784

In [77]:
df2.replace("a", "f")

         Date Type   Value
0  2020-03-01    f  11.432
1  2020-03-02    b  13.031
2  2020-03-01    c  20.784
3  2020-03-03    f  99.906
4  2020-03-02    f   1.303
5  2020-03-03    c  20.784

---
## **Combining Data**
### **Merging**

In [78]:
data1 = pd.DataFrame({'X1': ['a', 'b', 'c'],
                      'X2': [11.432, 1.303, 99.906]})
data1

  X1      X2
0  a  11.432
1  b   1.303
2  c  99.906

In [79]:
data2 = pd.DataFrame({'X1': ['a', 'b', 'd'],
                      'X3': [20.784, None , 20.784]})
data2

  X1      X3
0  a  20.784
1  b     NaN
2  d  20.784

In [80]:
pd.merge(data1, data2, how='left', on='X1')

  X1      X2      X3
0  a  11.432  20.784
1  b   1.303     NaN
2  c  99.906     NaN

In [81]:
pd.merge(data1, data2, how='right',on='X1')

  X1      X2      X3
0  a  11.432  20.784
1  b   1.303     NaN
2  d     NaN  20.784

In [82]:
pd.merge(data1, data2, how='inner', on='X1')

  X1      X2      X3
0  a  11.432  20.784
1  b   1.303     NaN

In [83]:
pd.merge(data1, data2, how='outer', on='X1')

  X1      X2      X3
0  a  11.432  20.784
1  b   1.303     NaN
2  c  99.906     NaN
3  d     NaN  20.784

### **Joining**

In [84]:
data3 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'], 'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})
data4 = pd.DataFrame({'key': ['K0', 'K1', 'K2'], 'B': ['B0', 'B1', 'B2']})
data3.join(data4, lsuffix='_data3', rsuffix='_data4')

  key_data3   A key_data4    B
0        K0  A0        K0   B0
1        K1  A1        K1   B1
2        K2  A2        K2   B2
3        K3  A3       NaN  NaN
4        K4  A4       NaN  NaN
5        K5  A5       NaN  NaN

### **Concatenate**

In [85]:
s.append(s2)

a    3.0
b   -5.0
c    7.0
d    4.0
a    3.0
c    7.0
d    4.0
e    NaN
b   -5.0
dtype: float64

In [86]:
pd.concat([data1, data2], axis=1, join='inner')

  X1      X2 X1      X3
0  a  11.432  a  20.784
1  b   1.303  b     NaN
2  c  99.906  d  20.784